#ifndef _serial_  
#define _serial_  

#include "stm32f10x.h"  
#include "stdio.h"  


#define MAX_UART_DATA_LEN	sizeof(strProtocol)				//串口能接收的最大数据长度

#define FRAME_HEAD		0xFD	//帧头
#define FRAME_TAIL		0xEB	//帧尾

#define UART_RX_READY	0
#define UART_RX_OK		1

#pragma pack(1)

//蓝牙数据控制指令---B5
typedef struct  tagBluetoothData
{
	u8		DataBuff[9];			//要设置的音乐使能状态
}strBluetoothData;
//蓝牙数据控制指令---B5
typedef struct  tagBluetoothCmd
{
	strBluetoothData		DataBuff;			//要设置的音乐使能状态
	u8		SumCheck;		//和校验	
	u8		Tail;			////帧尾，0XEB
}strBluetoothCmd;

//协议结构体
typedef struct  tagProtocol
{
	u8		Head;					//帧头，0XFD
	u8		CmdCode;				//指令功能码
	u8		TxDeviceId;				//发送机地址
	u8		RxDeviceId;				//接收机地址	
	u8		Reserve;				//预留字节
	u8		Reserve1;				//预留字节
	u16		Length;					//数据长度,包含所有数据--帧头、校验、帧尾等。		
	union
	{
		strBluetoothCmd		BluetoothCmd;			//蓝牙数据控制指令---B5
	}CmdData;
}strProtocol;

typedef struct tagUart
{
	//strBluetoothData DataBuff;		//串口接收数据的缓存区
	u8 RxCnt;						//串口数据接收计数
	u8 RxState; 					//串口数据接收状态

}strUart;

#pragma pack(4)  


extern strUart Uart;
extern strProtocol	ProtocolData;
extern u8* pProtocolData;

//------------------------------------------------------------------------------------------  

/*******************************************************************************
* 函 数 名         : fputc
* 函数功能         : printf会调用
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/
int fputc(int ch, FILE* p);

/*******************************************************************************
* 函 数 名         : serial1_init
* 函数功能         : IO端口及串口1，时钟初始化函数
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/
void serial1_init(u32 bt);


/*******************************************************************************
* 函 数 名         : serial1_sned_char
* 函数功能         : 串口1发送一字节
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/
void serial1_sned_char(u8 temp);


/*******************************************************************************
* 函 数 名         : serial1_sned_buff
* 函数功能         : 串口1发送一字符串
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/
void serial1_sned_buff(u8 buf[], u32 len);

//-----------------------------------------------------------------------------------------------------  

/*******************************************************************************
* 函 数 名         : serial2_init
* 函数功能         : IO端口及串口2，时钟初始化函数
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/
void serial2_init(u32 bt);



/*******************************************************************************
* 函 数 名         : serial2_sned_char
* 函数功能         : 串口2发送一字节
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/
void serial2_sned_char(u8 temp);



/*******************************************************************************
* 函 数 名         : serial2_sned_buff
* 函数功能         : 串口2发送一字符串
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/
void serial2_sned_buff(u8 buf[], u32 len);


//--------------------------------------------------------------------------------------------------------  

/*******************************************************************************
* 函 数 名         : serial3_init
* 函数功能         : IO端口及串口3，时钟初始化函数
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/
void serial3_init(u32 bt);



/*******************************************************************************
* 函 数 名         : serial3_sned_char
* 函数功能         : 串口3发送一字节
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/
void serial3_sned_char(u8 temp);



/*******************************************************************************
* 函 数 名         : serial3_sned_buff
* 函数功能         : 串口3发送一字符串
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/
void serial3_sned_buff(u8 buf[], u32 len);

#endif
